{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report listing two leaderboard flag-indicator features and their related files/components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend leaderboard and styling files.",
  "frontend/index.css": "Tailwind base and theme variables defining light and dark mode color tokens and global styles.",
  "frontend/index.html": "Base HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering the ArtistLeaderboardPage with global styles.",
  "frontend/src/components/leaderboard/ArtistRow.tsx": "Renders each artist’s row with rank, avatar, scores, trend, hype badge, and top‑10 US flag icon.",
  "frontend/src/components/leaderboard/HypeBadge.tsx": "Displays a small animated saffron‑accented Hype badge with a flame icon.",
  "frontend/src/components/leaderboard/Leaderboard.tsx": "Wraps the leaderboard header and maps artist data into ArtistRow components.",
  "frontend/src/components/leaderboard/LeaderboardHeader.tsx": "Static desktop‑only header row labeling rank, artist, score, and trend columns.",
  "frontend/src/components/leaderboard/RankShiftIndicator.tsx": "Shows up, down, or neutral indicators based on reach‑score shift values.",
  "frontend/src/data/artistLeaderboardSample.ts": "Sample dataset of 10 artists including ranks, avatars, reach scores, and trending flags.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and refreshes a backend actor based on Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, identity loading, and status flags.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, including background, accent, and mandala pattern styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, importing global styles.",
  "frontend/src/pages/ArtistLeaderboardPage.tsx": "Renders the Artist Leaderboard page with themed styling, header/footer, and the Leaderboard component using sample data.",
  "frontend/src/types/leaderboard.ts": "Declares the Artist interface describing leaderboard artist fields.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme tokens, OKLCH color mappings, plugins, and extended utilities.",
  "project_state.json": "Stores project metadata, design goals, requirements, and image needs for the Artist Leaderboard feature."
}