{
  "kind": "build_request",
  "title": "Remove avatar icons, sharpen leaderboard cards, and add music + business corner aesthetics",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Remove the profile picture/avatar icon from each Artist Leaderboard row in both mobile and desktop layouts, without changing existing rank, artist name, Reach Score, trend indicator, Hype badge, or top-10 US flag behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "remove the profile picture icon"
        ]
      },
      "acceptanceCriteria": [
        "On mobile rows, no Avatar/portrait circle is rendered anywhere in the row layout.",
        "On desktop rows, no Avatar/portrait circle is rendered anywhere in the row layout.",
        "Artist name, top-10 US flag icon (when applicable), Hype badge (when applicable), Reach Score, and RankShiftIndicator still render and align correctly.",
        "No broken layout/extra spacing remains where the avatar used to be."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Sharpen the leaderboard row/card boxes by reducing corner rounding and making edges look crisper, while keeping the current light-blue background theme and overall readability.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "sharpen the boxes"
        ]
      },
      "acceptanceCriteria": [
        "Leaderboard row/cards have visibly less-rounded corners than before (crisper edges).",
        "Hover/focus states still look consistent with the current theme and do not reduce text contrast.",
        "The change applies consistently across mobile and desktop row/cards and any leaderboard container cards that use the same styling."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Add subtle music-themed and business-themed aesthetic elements as decorative right-corner accents in the Artist Leaderboard UI, implemented using generated static image assets and styled to match the existing light-blue + coffee/saffron/copper palette.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "include music and business aesthetics in the right corners"
        ]
      },
      "acceptanceCriteria": [
        "A music-themed corner accent is visible in a right-side corner placement (e.g., top-right) of the leaderboard UI and does not overlap text/content.",
        "A business-themed corner accent is visible in a right-side corner placement (e.g., bottom-right or another right-corner location) of the leaderboard UI and does not overlap text/content.",
        "Corner accents remain subtle (low visual dominance), preserve readability, and scale appropriately on mobile and desktop.",
        "All new decorative images are served from static frontend assets (not fetched from external URLs and not routed through the backend)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn UI sources are read-only).",
    "Do not change any Internet Identity hooks or actor hooks under the immutable paths listed in SYSTEM_CONTEXT.",
    "Keep the existing top-10 American flag indicator behavior intact."
  ],
  "nonGoals": [
    "Adding or changing backend logic (no Motoko changes required).",
    "Changing leaderboard data ranking logic or introducing new leaderboard fields.",
    "Replacing the existing mandala/paper texture background system."
  ],
  "imageRequirements": {
    "required": [
      "Minimal line-art music corner ornament (music-corner-ornament.dim_128x128.png)",
      "Minimal line-art business corner ornament (business-corner-ornament.dim_128x128.png)"
    ],
    "edits": []
  }
}