{
  "kind": "build_request",
  "title": "Add American flag indicator for top 10 artists (non-photo assets)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Add an American flag indicator for the top 10 artists on the Artist Leaderboard, displayed inline with each artist’s name area in both mobile and desktop row layouts (without changing existing rank, avatar, Reach Score, Trend, and Hype indicator behavior).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "include american flags for top 10 artists"
        ]
      },
      "acceptanceCriteria": [
        "For artists with rank 1–10, an American flag icon is visible next to (or immediately before) the artist name on both mobile and desktop layouts.",
        "For artists with rank > 10 (if present in the future), the flag indicator is not shown.",
        "Existing row content remains intact: rank badge, avatar, artist name, Reach Score, RankShiftIndicator, and HypeBadge behavior all remain present and functional."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Implement the American flag indicator using a non-photo asset (flat icon/SVG/illustration) served as a static frontend asset (not fetched as a photo and not routed through the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "do not take photos"
        ]
      },
      "acceptanceCriteria": [
        "The American flag shown for ranks 1–10 uses a generated static image placed under frontend/public/assets/generated and referenced by a stable local path (no remote/photo URLs).",
        "The flag asset renders crisply at small sizes (row-level icon) and remains readable on the existing light-blue mandala background.",
        "No new photo-based images are introduced for the flag indicator."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain a single Motoko actor (no new backend services).",
    "Do not introduce photo-based assets for the American flag indicator; use a flat/icon-style graphic instead."
  ],
  "nonGoals": [
    "Adding country flags for ranks outside the top 10.",
    "Changing the leaderboard theme, layout structure, or existing sample artist names/scores beyond what is required to display the flag indicator.",
    "Backend persistence or API changes for storing country metadata."
  ],
  "imageRequirements": {
    "required": [
      "Flat American flag icon, simple vector-like style, no photographic texture (us-flag-icon.dim_64x48.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}