{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Leaderboard UI polish: remove avatars, crisper cards, and add corner accent ornaments",
  "requirements": [
    {
      "id": "REQ-15",
      "summary": "Remove avatar/profile picture from each Artist Leaderboard row on mobile and desktop while preserving rank, name, Reach Score, trend indicator, Hype badge, and top-10 US flag behavior and alignment.",
      "acceptanceCriteria": [
        "On mobile rows, no Avatar/portrait circle is rendered anywhere in the row layout.",
        "On desktop rows, no Avatar/portrait circle is rendered anywhere in the row layout.",
        "Artist name, top-10 US flag icon (when applicable), Hype badge (when applicable), Reach Score, and RankShiftIndicator still render and align correctly.",
        "No broken layout/extra spacing remains where the avatar used to be."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/leaderboard/ArtistRow.tsx",
          "operation": "modify",
          "description": "Remove shadcn Avatar usage (Avatar/AvatarImage/AvatarFallback) from both mobile and desktop row layouts; tighten the row flex/grid spacing so name/flag/Hype badge align correctly without leftover avatar gap, and keep existing top-10 US flag, Hype badge, Reach Score, and RankShiftIndicator rendering/placement intact. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Make leaderboard row/card boxes look crisper by reducing corner rounding consistently across mobile and desktop while keeping the current light-blue theme and readable hover/focus states.",
      "acceptanceCriteria": [
        "Leaderboard row/cards have visibly less-rounded corners than before (crisper edges).",
        "Hover/focus states still look consistent with the current theme and do not reduce text contrast.",
        "The change applies consistently across mobile and desktop row/cards and any leaderboard container cards that use the same styling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/leaderboard/ArtistRow.tsx",
          "operation": "modify",
          "description": "Reduce border-radius on the outer row/card container and its rank badge block(s) (e.g., switch from larger rounding to smaller rounding) and ensure hover styling remains consistent with the existing glassmorphism + light-blue theme. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If needed for consistency, add/adjust a leaderboard-specific utility/class for crisper card rounding (without changing shadcn UI sources under frontend/src/components/ui and without altering global radius tokens in a way that affects unrelated components). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Add subtle music-themed and business-themed decorative right-corner accents to the Artist Leaderboard UI using generated static image assets that match the light-blue + coffee/saffron/copper palette.",
      "acceptanceCriteria": [
        "A music-themed corner accent is visible in a right-side corner placement (e.g., top-right) of the leaderboard UI and does not overlap text/content.",
        "A business-themed corner accent is visible in a right-side corner placement (e.g., bottom-right or another right-corner location) of the leaderboard UI and does not overlap text/content.",
        "Corner accents remain subtle (low visual dominance), preserve readability, and scale appropriately on mobile and desktop.",
        "All new decorative images are served from static frontend assets (not fetched from external URLs and not routed through the backend)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/music-corner-ornament.dim_128x128.png",
          "operation": "create",
          "description": "Add the generated static image asset at exactly this path for the music-themed corner ornament (served as a static frontend asset). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/public/assets/generated/business-corner-ornament.dim_128x128.png",
          "operation": "create",
          "description": "Add the generated static image asset at exactly this path for the business-themed corner ornament (served as a static frontend asset). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ArtistLeaderboardPage.tsx",
          "operation": "modify",
          "description": "Wire the two decorative corner accents into the Leaderboard UI container as subtle, non-interactive, right-corner overlays (e.g., top-right music ornament and bottom-right business ornament) positioned so they do not overlap header/rows and remain responsive on mobile/desktop. Use the static assets: frontend/public/assets/generated/music-corner-ornament.dim_128x128.png and frontend/public/assets/generated/business-corner-ornament.dim_128x128.png. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal styling helpers (e.g., opacity, positioning constraints, pointer-events, and responsive sizing) for the corner accent images so they stay subtle, preserve readability, and avoid overlapping leaderboard content. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}